xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEdsadc_bf.h
/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INMUX */
#define IFX_EDSADC_CH_MODCFG_INMUX_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INMUX */
#define IFX_EDSADC_CH_MODCFG_INMUX_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INMUX */
#define IFX_EDSADC_CH_MODCFG_INMUX_OFF (10u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INMODE */
#define IFX_EDSADC_CH_MODCFG_INMODE_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INMODE */
#define IFX_EDSADC_CH_MODCFG_INMODE_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INMODE */
#define IFX_EDSADC_CH_MODCFG_INMODE_OFF (12u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INMAC */
#define IFX_EDSADC_CH_MODCFG_INMAC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INMAC */
#define IFX_EDSADC_CH_MODCFG_INMAC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INMAC */
#define IFX_EDSADC_CH_MODCFG_INMAC_OFF (14u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INCWC */
#define IFX_EDSADC_CH_MODCFG_INCWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INCWC */
#define IFX_EDSADC_CH_MODCFG_INCWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INCWC */
#define IFX_EDSADC_CH_MODCFG_INCWC_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.DIVM */
#define IFX_EDSADC_CH_MODCFG_DIVM_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.DIVM */
#define IFX_EDSADC_CH_MODCFG_DIVM_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.DIVM */
#define IFX_EDSADC_CH_MODCFG_DIVM_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.ACSD */
#define IFX_EDSADC_CH_MODCFG_ACSD_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.ACSD */
#define IFX_EDSADC_CH_MODCFG_ACSD_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.ACSD */
#define IFX_EDSADC_CH_MODCFG_ACSD_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.DITHEN */
#define IFX_EDSADC_CH_MODCFG_DITHEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.DITHEN */
#define IFX_EDSADC_CH_MODCFG_DITHEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.DITHEN */
#define IFX_EDSADC_CH_MODCFG_DITHEN_OFF (26u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.IREN */
#define IFX_EDSADC_CH_MODCFG_IREN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.IREN */
#define IFX_EDSADC_CH_MODCFG_IREN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.IREN */
#define IFX_EDSADC_CH_MODCFG_IREN_OFF (27u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.APC */
#define IFX_EDSADC_CH_MODCFG_APC_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.APC */
#define IFX_EDSADC_CH_MODCFG_APC_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.APC */
#define IFX_EDSADC_CH_MODCFG_APC_OFF (28u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.MMWC */
#define IFX_EDSADC_CH_MODCFG_MMWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.MMWC */
#define IFX_EDSADC_CH_MODCFG_MMWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.MMWC */
#define IFX_EDSADC_CH_MODCFG_MMWC_OFF (31u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.DSS */
#define IFX_EDSADC_CH_DICFG_DSS_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.DSS */
#define IFX_EDSADC_CH_DICFG_DSS_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.DSS */
#define IFX_EDSADC_CH_DICFG_DSS_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.DSRCEX */
#define IFX_EDSADC_CH_DICFG_DSRCEX_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.DSRCEX */
#define IFX_EDSADC_CH_DICFG_DSRCEX_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.DSRCEX */
#define IFX_EDSADC_CH_DICFG_DSRCEX_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.CSRCEX */
#define IFX_EDSADC_CH_DICFG_CSRCEX_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.CSRCEX */
#define IFX_EDSADC_CH_DICFG_CSRCEX_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.CSRCEX */
#define IFX_EDSADC_CH_DICFG_CSRCEX_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.DSWC */
#define IFX_EDSADC_CH_DICFG_DSWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.DSWC */
#define IFX_EDSADC_CH_DICFG_DSWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.DSWC */
#define IFX_EDSADC_CH_DICFG_DSWC_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.TRSEL */
#define IFX_EDSADC_CH_DICFG_TRSEL_LEN (4u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.TRSEL */
#define IFX_EDSADC_CH_DICFG_TRSEL_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.TRSEL */
#define IFX_EDSADC_CH_DICFG_TRSEL_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_EDSADC_CH_DICFG_ITRMODE_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_EDSADC_CH_DICFG_ITRMODE_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.ITRMODE */
#define IFX_EDSADC_CH_DICFG_ITRMODE_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_EDSADC_CH_DICFG_TSTRMODE_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_EDSADC_CH_DICFG_TSTRMODE_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.TSTRMODE */
#define IFX_EDSADC_CH_DICFG_TSTRMODE_OFF (22u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.DRM */
#define IFX_EDSADC_CH_DICFG_DRM_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.DRM */
#define IFX_EDSADC_CH_DICFG_DRM_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.DRM */
#define IFX_EDSADC_CH_DICFG_DRM_OFF (26u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.TSM */
#define IFX_EDSADC_CH_DICFG_TSM_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.TSM */
#define IFX_EDSADC_CH_DICFG_TSM_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.TSM */
#define IFX_EDSADC_CH_DICFG_TSM_OFF (28u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.RDM */
#define IFX_EDSADC_CH_DICFG_RDM_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.RDM */
#define IFX_EDSADC_CH_DICFG_RDM_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.RDM */
#define IFX_EDSADC_CH_DICFG_RDM_OFF (29u)

/** \brief Length for Ifx_EDSADC_CH_DICFG_Bits.MSWC */
#define IFX_EDSADC_CH_DICFG_MSWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_DICFG_Bits.MSWC */
#define IFX_EDSADC_CH_DICFG_MSWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_DICFG_Bits.MSWC */
#define IFX_EDSADC_CH_DICFG_MSWC_OFF (31u)

/** \brief Length for Ifx_EDSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_EDSADC_CH_FCFGM_FIR0EN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_FCFGM_Bits.FIR0EN */
#define IFX_EDSADC_CH_FCFGM_FIR0EN_MSK (0x1u)

