xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEdsadc_bf.h
/** \brief Length for Ifx_EDSADC_CH_OVSCFG_Bits.SDTH */
#define IFX_EDSADC_CH_OVSCFG_SDTH_LEN (11u)

/** \brief Mask for Ifx_EDSADC_CH_OVSCFG_Bits.SDTH */
#define IFX_EDSADC_CH_OVSCFG_SDTH_MSK (0x7ffu)

/** \brief Offset for Ifx_EDSADC_CH_OVSCFG_Bits.SDTH */
#define IFX_EDSADC_CH_OVSCFG_SDTH_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_IWCTR_Bits.ISC */
#define IFX_EDSADC_CH_IWCTR_ISC_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_IWCTR_Bits.ISC */
#define IFX_EDSADC_CH_IWCTR_ISC_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_IWCTR_Bits.ISC */
#define IFX_EDSADC_CH_IWCTR_ISC_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_IWCTR_Bits.IWS */
#define IFX_EDSADC_CH_IWCTR_IWS_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_IWCTR_Bits.IWS */
#define IFX_EDSADC_CH_IWCTR_IWS_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_IWCTR_Bits.IWS */
#define IFX_EDSADC_CH_IWCTR_IWS_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_IWCTR_Bits.FRC */
#define IFX_EDSADC_CH_IWCTR_FRC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_IWCTR_Bits.FRC */
#define IFX_EDSADC_CH_IWCTR_FRC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_IWCTR_Bits.FRC */
#define IFX_EDSADC_CH_IWCTR_FRC_OFF (5u)

/** \brief Length for Ifx_EDSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_EDSADC_CH_IWCTR_REPVAL_LEN (4u)

/** \brief Mask for Ifx_EDSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_EDSADC_CH_IWCTR_REPVAL_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_EDSADC_CH_IWCTR_REPVAL_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_EDSADC_CH_IWCTR_NVALDIS_LEN (6u)

/** \brief Mask for Ifx_EDSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_EDSADC_CH_IWCTR_NVALDIS_MSK (0x3fu)

/** \brief Offset for Ifx_EDSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_EDSADC_CH_IWCTR_NVALDIS_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_EDSADC_CH_IWCTR_NVALINT_LEN (6u)

/** \brief Mask for Ifx_EDSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_EDSADC_CH_IWCTR_NVALINT_MSK (0x3fu)

/** \brief Offset for Ifx_EDSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_EDSADC_CH_IWCTR_NVALINT_OFF (24u)

/** \brief Length for Ifx_EDSADC_CH_IIVAL_Bits.IVAL */
#define IFX_EDSADC_CH_IIVAL_IVAL_LEN (26u)

/** \brief Mask for Ifx_EDSADC_CH_IIVAL_Bits.IVAL */
#define IFX_EDSADC_CH_IIVAL_IVAL_MSK (0x3ffffffu)

/** \brief Offset for Ifx_EDSADC_CH_IIVAL_Bits.IVAL */
#define IFX_EDSADC_CH_IIVAL_IVAL_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_ISTAT_Bits.NVALCNT */
#define IFX_EDSADC_CH_ISTAT_NVALCNT_LEN (6u)

/** \brief Mask for Ifx_EDSADC_CH_ISTAT_Bits.NVALCNT */
#define IFX_EDSADC_CH_ISTAT_NVALCNT_MSK (0x3fu)

/** \brief Offset for Ifx_EDSADC_CH_ISTAT_Bits.NVALCNT */
#define IFX_EDSADC_CH_ISTAT_NVALCNT_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_ISTAT_Bits.REPCNT */
#define IFX_EDSADC_CH_ISTAT_REPCNT_LEN (4u)

/** \brief Mask for Ifx_EDSADC_CH_ISTAT_Bits.REPCNT */
#define IFX_EDSADC_CH_ISTAT_REPCNT_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CH_ISTAT_Bits.REPCNT */
#define IFX_EDSADC_CH_ISTAT_REPCNT_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_ISTAT_Bits.INTEN */
#define IFX_EDSADC_CH_ISTAT_INTEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_ISTAT_Bits.INTEN */
#define IFX_EDSADC_CH_ISTAT_INTEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_ISTAT_Bits.INTEN */
#define IFX_EDSADC_CH_ISTAT_INTEN_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.SRLVL */
#define IFX_EDSADC_CH_RFC_SRLVL_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.SRLVL */
#define IFX_EDSADC_CH_RFC_SRLVL_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.SRLVL */
#define IFX_EDSADC_CH_RFC_SRLVL_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.RDEC */
#define IFX_EDSADC_CH_RFC_RDEC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.RDEC */
#define IFX_EDSADC_CH_RFC_RDEC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.RDEC */
#define IFX_EDSADC_CH_RFC_RDEC_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.WREC */
#define IFX_EDSADC_CH_RFC_WREC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.WREC */
#define IFX_EDSADC_CH_RFC_WREC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.WREC */
#define IFX_EDSADC_CH_RFC_WREC_OFF (5u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.FIFL */
#define IFX_EDSADC_CH_RFC_FIFL_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.FIFL */
#define IFX_EDSADC_CH_RFC_FIFL_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.FIFL */
#define IFX_EDSADC_CH_RFC_FIFL_OFF (6u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.FILL */
#define IFX_EDSADC_CH_RFC_FILL_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.FILL */
#define IFX_EDSADC_CH_RFC_FILL_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.FILL */
#define IFX_EDSADC_CH_RFC_FILL_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.RDERR */
#define IFX_EDSADC_CH_RFC_RDERR_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.RDERR */
#define IFX_EDSADC_CH_RFC_RDERR_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.RDERR */
#define IFX_EDSADC_CH_RFC_RDERR_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_RFC_Bits.WRERR */
#define IFX_EDSADC_CH_RFC_WRERR_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_RFC_Bits.WRERR */
#define IFX_EDSADC_CH_RFC_WRERR_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_RFC_Bits.WRERR */
#define IFX_EDSADC_CH_RFC_WRERR_OFF (21u)

/** \brief Length for Ifx_EDSADC_CH_RESM_Bits.RESULTLO */
#define IFX_EDSADC_CH_RESM_RESULTLO_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_RESM_Bits.RESULTLO */
#define IFX_EDSADC_CH_RESM_RESULTLO_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_RESM_Bits.RESULTLO */
#define IFX_EDSADC_CH_RESM_RESULTLO_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_RESM_Bits.RESULTHI */
#define IFX_EDSADC_CH_RESM_RESULTHI_LEN (16u)

/** \brief Mask for Ifx_EDSADC_CH_RESM_Bits.RESULTHI */
#define IFX_EDSADC_CH_RESM_RESULTHI_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_CH_RESM_Bits.RESULTHI */
#define IFX_EDSADC_CH_RESM_RESULTHI_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_OFFCOMP_Bits.OFFSET */
#define IFX_EDSADC_CH_OFFCOMP_OFFSET_LEN (16u)

